MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tamp.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_tamp.h
  * @brief   Header file of TAMP LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_TAMP_H
#define STM32C5XX_LL_TAMP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(TAMP)

/** @defgroup TAMP_LL TAMP
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported constants ------------------------------------------------------------*/
/** @defgroup TAMP_LL_Exported_Constants LL TAMP Constants
  * @{
  */
#define LL_POSITION_FIRST_ITAMP        TAMP_CR1_ITAMP3E_Pos
#define LL_POSITION_OFFSET_REG_ITAMP   16U
#define TAMP_CR2_CFG_MSK               (LL_TAMP_NOERASE_TAMPER_ALL \
                                        | LL_TAMP_ACTIVELEVEL_TAMP_ALL | LL_TAMP_MASK_TAMPER_ALL)

#define LL_TAMP_NUMBER_TAMPERS         3U /*!< Number of tampers */
#define LL_TAMP_POSITION_FIRST_MASKED  TAMP_CR2_TAMP1MSK_Pos /*!< Tamper first masked */
#define LL_TAMP_BACKUP_NB              TAMP_BACKUP_NB /*!< Number of TAMP backup registers */

/** @defgroup TAMP_LL_EC_TAMPER  TAMPER
  * @{
  */
#define LL_TAMP_1                    TAMP_CR1_TAMP1E /*!< Tamper 1 input detection */
#define LL_TAMP_2                    TAMP_CR1_TAMP2E /*!< Tamper 2 input detection */
#define LL_TAMP_3                    TAMP_CR1_TAMP3E /*!< Tamper 3 input detection */
#define LL_TAMP_ALL                  (TAMP_CR1_TAMP1E | TAMP_CR1_TAMP2E | TAMP_CR1_TAMP3E) /*!< All tamper input selection */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_MASK  TAMPER MASK
  * @{
  */
#define LL_TAMP_MASK_NONE            0U
#define LL_TAMP_MASK_TAMPER          TAMP_CR2_TAMP1MSK /*!< Tamper 1 event generates a trigger event. TAMP1F is masked and internally cleared by hardware. The backup registers are not erased */
#define LL_TAMP_MASK_TAMPER1         TAMP_CR2_TAMP1MSK /*!< Tamper 1 event generates a trigger event. TAMP1F is masked and internally cleared by hardware. The backup registers are not erased */
#define LL_TAMP_MASK_TAMPER2         TAMP_CR2_TAMP2MSK /*!< Tamper 2 event generates a trigger event. TAMP2F is masked and internally cleared by hardware. The backup registers are not erased. */
#define LL_TAMP_MASK_TAMPER3         TAMP_CR2_TAMP3MSK /*!< Tamper 3 event generates a trigger event. TAMP3F is masked and internally cleared by hardware. The backup registers are not erased. */
#define LL_TAMP_MASK_TAMPER_ALL      (TAMP_CR2_TAMP1MSK | TAMP_CR2_TAMP2MSK | TAMP_CR2_TAMP3MSK) /*!< Tamper 1, 2 and 3 events generate a trigger event. TAMP1F, TAMP2F and TAMP3F are masked and internally cleared by hardware. The backup registers are not erased */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_NOERASE  TAMPER NO ERASE
  * @{
  */
#define LL_TAMP_ERASE_ACTIVATE_ALL   0U
#define LL_TAMP_NOERASE_TAMPER       TAMP_CR2_TAMP1POM /*!< Tamper 1 event does not erase the backup registers. */
#define LL_TAMP_NOERASE_TAMPER1      TAMP_CR2_TAMP1POM /*!< Tamper 1 event does not erase the backup registers. */
#define LL_TAMP_NOERASE_TAMPER2      TAMP_CR2_TAMP2POM /*!< Tamper 2 event does not erase the backup registers. */
#define LL_TAMP_NOERASE_TAMPER3      TAMP_CR2_TAMP3POM /*!< Tamper 3 event does not erase the backup registers. */
#define LL_TAMP_NOERASE_TAMPER_ALL   (TAMP_CR2_TAMP1POM | TAMP_CR2_TAMP2POM | TAMP_CR2_TAMP3POM)
/*!< All tamper events do not erase the backup registers. */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_BACKUP_BLOCK BACKUP BLOCKED
  * @{
  */

#define LL_TAMP_BACKUP_BLOCK_DISABLE   0U                /*!< Tamper backup block is disabled */
#define LL_TAMP_BACKUP_BLOCK_ENABLE    TAMP_CR2_BKBLOCK  /*!< Tamper backup block is enabled */

/**
  * @}
  */


/** @defgroup TAMP_LL_EC_TAMPER_DURATION  TAMPER DURATION
  * @{
  */
#define LL_TAMP_DURATION_1RTCCLK     0U                     /*!< Tamper pins are pre-charged before sampling during 1 RTCCLK cycle  */
#define LL_TAMP_DURATION_2RTCCLK     TAMP_FLTCR_TAMPPRCH_0  /*!< Tamper pins are pre-charged before sampling during 2 RTCCLK cycles */
#define LL_TAMP_DURATION_4RTCCLK     TAMP_FLTCR_TAMPPRCH_1  /*!< Tamper pins are pre-charged before sampling during 4 RTCCLK cycles */
#define LL_TAMP_DURATION_8RTCCLK     TAMP_FLTCR_TAMPPRCH    /*!< Tamper pins are pre-charged before sampling during 8 RTCCLK cycles */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_FILTER  TAMPER FILTER
  * @{
  */
#define LL_TAMP_FILTER_DISABLE       0U                      /*!< Tamper filter is disabled */
#define LL_TAMP_FILTER_2SAMPLES      TAMP_FLTCR_TAMPFLT_0    /*!< Tamper is activated after 2 consecutive samples at the active level */
#define LL_TAMP_FILTER_4SAMPLES      TAMP_FLTCR_TAMPFLT_1    /*!< Tamper is activated after 4 consecutive samples at the active level */
#define LL_TAMP_FILTER_8SAMPLES      TAMP_FLTCR_TAMPFLT      /*!< Tamper is activated after 8 consecutive samples at the active level. */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_SAMPLFREQDIV  TAMPER SAMPLING FREQUENCY DIVIDER
  * @{
  */
#define LL_TAMP_SAMPLFREQDIV_32768   0U                                              /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 32768 */
#define LL_TAMP_SAMPLFREQDIV_16384   TAMP_FLTCR_TAMPFREQ_0                           /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 16384 */
#define LL_TAMP_SAMPLFREQDIV_8192    TAMP_FLTCR_TAMPFREQ_1                           /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 8192 */
#define LL_TAMP_SAMPLFREQDIV_4096    (TAMP_FLTCR_TAMPFREQ_1 | TAMP_FLTCR_TAMPFREQ_0) /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 4096 */
#define LL_TAMP_SAMPLFREQDIV_2048    TAMP_FLTCR_TAMPFREQ_2                           /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 2048 */
#define LL_TAMP_SAMPLFREQDIV_1024    (TAMP_FLTCR_TAMPFREQ_2 | TAMP_FLTCR_TAMPFREQ_0) /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 1024 */
#define LL_TAMP_SAMPLFREQDIV_512     (TAMP_FLTCR_TAMPFREQ_2 | TAMP_FLTCR_TAMPFREQ_1) /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 512 */
#define LL_TAMP_SAMPLFREQDIV_256     TAMP_FLTCR_TAMPFREQ                             /*!< Each of the tamper inputs is sampled with a frequency = RTCCLK / 256 */
/**
  * @}
  */

