MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tamp.h
/** @defgroup TAMP_LL_EC_TAMPER_PULL_UP TAMPER PULL UP
  * @{
  */
#define LL_TAMP_PULL_UP_ENABLE        0U                    /*!< Precharge TAMP_INx pins before sampling (enable internal pull-up) */
#define LL_TAMP_PULL_UP_DISABLE       TAMP_FLTCR_TAMPPUDIS  /*!< Disable precharge of TAMP_INx pins                                */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_ACTIVELEVEL  TAMPER ACTIVE LEVEL
  * @{
  */
#define LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL  0U
#define LL_TAMP_ACTIVELEVEL_TAMP            TAMP_CR2_TAMP1TRG /*!< Tamper 1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP1    TAMP_CR2_TAMP1TRG /*!< Tamper 1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP2    TAMP_CR2_TAMP2TRG /*!< Tamper 2 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP3    TAMP_CR2_TAMP3TRG /*!< Tamper 2 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP_ALL (TAMP_CR2_TAMP1TRG | TAMP_CR2_TAMP2TRG | TAMP_CR2_TAMP3TRG)
/*!< All tamper input falling edges (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) trigger a tamper detection event */
/**
  * @}
  */


/** @defgroup TAMP_LL_EC_INTERNAL  INTERNAL TAMPER
  * @{
  */
#define LL_TAMP_ITAMP3                TAMP_CR1_ITAMP3E  /*!< Internal tamper 3: LSE monitoring */
#define LL_TAMP_ITAMP4                TAMP_CR1_ITAMP4E  /*!< Internal tamper 4: HSE monitoring */
#define LL_TAMP_ITAMP5                TAMP_CR1_ITAMP5E  /*!< Internal tamper 5: RTC calendar overflow */
#define LL_TAMP_ITAMP6                TAMP_CR1_ITAMP6E  /*!< Internal tamper 6: Unexpected debug activation */
#define LL_TAMP_ITAMP9                TAMP_CR1_ITAMP9E  /*!< Internal tamper 9: TRNG fault */
#define LL_TAMP_ITAMP11               TAMP_CR1_ITAMP11E /*!< Internal tamper 11: IWDG reset when tamper flag is set */
#define LL_TAMP_ITAMP_ALL             (TAMP_CR1_ITAMP3E  | TAMP_CR1_ITAMP4E  | TAMP_CR1_ITAMP5E \
                                       | TAMP_CR1_ITAMP6E  | TAMP_CR1_ITAMP9E  | TAMP_CR1_ITAMP11E) /*!< All internal tampers */
/**
  * @}
  */

/**
  * @defgroup TAMP_LL_EC_INTERNAL_MODE INTERNAL TAMPER MODE
  * @{
  */
#define LL_TAMP_ITAMP_ERASE_ACTIVE_ALL    0U
#define LL_TAMP_ITAMP_NOERASE_TAMPER      TAMP_CR3_ITAMP3POM  /*!< Internal tamper 3 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER3     TAMP_CR3_ITAMP3POM  /*!< Internal tamper 3 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER4     TAMP_CR3_ITAMP4POM  /*!< Internal tamper 4 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER5     TAMP_CR3_ITAMP5POM  /*!< Internal tamper 5 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER6     TAMP_CR3_ITAMP6POM  /*!< Internal tamper 6 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER9     TAMP_CR3_ITAMP9POM  /*!< Internal tamper 9 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER11    TAMP_CR3_ITAMP11POM /*!< Internal tamper 11 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER_ALL  (TAMP_CR3_ITAMP3POM | TAMP_CR3_ITAMP4POM | TAMP_CR3_ITAMP5POM \
                                           | TAMP_CR3_ITAMP6POM | TAMP_CR3_ITAMP9POM | TAMP_CR3_ITAMP11POM)
/*!< All internal tampers events do not erase the device secrets. */

/**
  * @}
  */


/** @defgroup TAMP_LL_EC_TAMPER_IT TAMPER IT
  * @{
  */
#define LL_TAMP_IT_NONE         0U
#define LL_TAMP_IT_TAMPER_1          TAMP_IER_TAMP1IE  /*!< Tamper 1 interrupt enabled */
#define LL_TAMP_IT_TAMPER_2          TAMP_IER_TAMP2IE  /*!< Tamper 2 interrupt enabled */
#define LL_TAMP_IT_TAMPER_3          TAMP_IER_TAMP3IE  /*!< Tamper 3 interrupt enabled */
#define LL_TAMP_IT_ALL               (TAMP_IER_TAMP1IE | TAMP_IER_TAMP2IE | TAMP_IER_TAMP3IE)
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_INTERNAL_TAMPER_IT INTERNAL TAMPER IT
  * @{
  */
#define LL_TAMP_INTERNAL_IT_NONE         0U
#define LL_TAMP_INTERNAL_IT_TAMPER_3    TAMP_IER_ITAMP3IE  /*!< Internal tamper 3 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_4    TAMP_IER_ITAMP4IE  /*!< Internal tamper 4 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_5    TAMP_IER_ITAMP5IE  /*!< Internal tamper 5 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_6    TAMP_IER_ITAMP6IE  /*!< Internal tamper 6 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_9    TAMP_IER_ITAMP9IE  /*!< Internal tamper 9 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_11   TAMP_IER_ITAMP11IE /*!< Internal tamper 11 interrupt enable */
#define LL_TAMP_INTERNAL_IT_ALL         (TAMP_IER_ITAMP3IE | TAMP_IER_ITAMP4IE | TAMP_IER_ITAMP5IE \
                                         | TAMP_IER_ITAMP6IE | TAMP_IER_ITAMP9IE | TAMP_IER_ITAMP11IE)
/**
  * @}
  */


/** @defgroup TAMP_LL_EC_TAMPER_REMAP TAMPER REMAP
  * @{
  */
#define LL_TAMP_RMP_TAMP_IN2_PA0_TO_PC1     TAMP_OR_IN2_RMP
#define LL_TAMP_RMP_TAMP_IN3_PA1_TO_PA2     TAMP_OR_IN3_RMP
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_BKP  BACKUP REGISTER
  * @{
  */
#define LL_TAMP_BKP_NUMBER                  TAMP_BACKUP_NB /*!< Number of TAMP backup registers */
#define LL_TAMP_BKP_DR0                     0U /*!< TAMP backup registers 0 */
#define LL_TAMP_BKP_DR1                     1U /*!< TAMP backup registers 1 */
#define LL_TAMP_BKP_DR2                     2U /*!< TAMP backup registers 2 */
#define LL_TAMP_BKP_DR3                     3U /*!< TAMP backup registers 3 */
#define LL_TAMP_BKP_DR4                     4U /*!< TAMP backup registers 4 */
#define LL_TAMP_BKP_DR5                     5U /*!< TAMP backup registers 5 */
#define LL_TAMP_BKP_DR6                     6U /*!< TAMP backup registers 6 */
#define LL_TAMP_BKP_DR7                     7U /*!< TAMP backup registers 7 */
#define LL_TAMP_BKP_DR8                     8U   /*!< TAMP backup registers 8 */
#define LL_TAMP_BKP_DR9                     9U   /*!< TAMP backup registers 9 */
#define LL_TAMP_BKP_DR10                    10U  /*!< TAMP backup registers 10 */
#define LL_TAMP_BKP_DR11                    11U  /*!< TAMP backup registers 11 */
#define LL_TAMP_BKP_DR12                    12U  /*!< TAMP backup registers 12 */
#define LL_TAMP_BKP_DR13                    13U  /*!< TAMP backup registers 13 */
#define LL_TAMP_BKP_DR14                    14U  /*!< TAMP backup registers 14 */
#define LL_TAMP_BKP_DR15                    15U  /*!< TAMP backup registers 15 */
#define LL_TAMP_BKP_DR16                    16U  /*!< TAMP backup registers 16 */
#define LL_TAMP_BKP_DR17                    17U  /*!< TAMP backup registers 17 */
#define LL_TAMP_BKP_DR18                    18U  /*!< TAMP backup registers 18 */
#define LL_TAMP_BKP_DR19                    19U  /*!< TAMP backup registers 19 */
#define LL_TAMP_BKP_DR20                    20U  /*!< TAMP backup registers 20 */
#define LL_TAMP_BKP_DR21                    21U  /*!< TAMP backup registers 21 */
#define LL_TAMP_BKP_DR22                    22U  /*!< TAMP backup registers 22 */
#define LL_TAMP_BKP_DR23                    23U  /*!< TAMP backup registers 23 */
#define LL_TAMP_BKP_DR24                    24U  /*!< TAMP backup registers 24 */
#define LL_TAMP_BKP_DR25                    25U  /*!< TAMP backup registers 25 */
#define LL_TAMP_BKP_DR26                    26U  /*!< TAMP backup registers 26 */
#define LL_TAMP_BKP_DR27                    27U  /*!< TAMP backup registers 27 */
#define LL_TAMP_BKP_DR28                    28U  /*!< TAMP backup registers 28 */
#define LL_TAMP_BKP_DR29                    29U  /*!< TAMP backup registers 29 */
#define LL_TAMP_BKP_DR30                    30U  /*!< TAMP backup registers 30 */
#define LL_TAMP_BKP_DR31                    31U  /*!< TAMP backup registers 31 */
/**
  * @}
  */

/** @defgroup TAMP_privilege_attributes_configuration_items TAMP attributes configuration items
  * @{
  */
#define LL_TAMP_ATTR_NPRIV 0UL /*!< Non-privileged attribute */
#define LL_TAMP_ATTR_PRIV  1UL /*!< Privileged attribute     */

#define LL_TAMP_PRIV_ITEM_TAMPPRIV  TAMP_PRIVCFGR_TAMPPRIV  /*!< Privilege attribute of tamper protection  */
#define LL_TAMP_PRIV_ZONE_BKPWPRIV  TAMP_PRIVCFGR_BKPWPRIV  /*!< Privilege multiple attribute of Backup
                                                                 registers zone 2 */
#define LL_TAMP_PRIV_ZONE_BKPRWPRIV TAMP_PRIVCFGR_BKPRWPRIV /*!< Privilege multiple attribute of Backup
                                                                 registers zone 1 */

/**
  * @}
  */


/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup TAMP_LL_Exported_Macros LL TAMP Macros
  * @{
  */

/** @defgroup TAMP_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */


/**
  * @brief  Write a value in TAMP register.
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  */
#define LL_TAMP_WRITE_REG(__REG__, __VALUE__) STM32_WRITE_REG(TAMP->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TAMP register.

  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_TAMP_READ_REG(__REG__) STM32_READ_REG(TAMP->__REG__)
/**
  * @}
  */

/** @defgroup TAMP_LL_EM_helper Helper macros
  * @{
  */

/**
  * @brief Helper macro to retrieve pull_up precharge configuration.
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_PULL_UP_ENABLE
  *        @arg @ref LL_TAMP_PULL_UP_DISABLE
  */
#define LL_TAMP_GET_PULL_UP(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPPUDIS)

/**
  * @brief Helper macro to retrieve pull_up precharge duration configuration.
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_DURATION_1RTCCLK
  *        @arg @ref LL_TAMP_DURATION_2RTCCLK
  *        @arg @ref LL_TAMP_DURATION_4RTCCLK
  *        @arg @ref LL_TAMP_DURATION_8RTCCLK
  */
#define LL_TAMP_GET_PRECHARGE_DURATION(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPPRCH)

/**
  * @brief Helper macro to retrieve pull_up precharge configuration.
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_FILTER_DISABLE
  *        @arg @ref LL_TAMP_FILTER_2SAMPLES
  *        @arg @ref LL_TAMP_FILTER_4SAMPLES
  *        @arg @ref LL_TAMP_FILTER_8SAMPLES
  */
#define LL_TAMP_GET_FILTER_SAMPLE(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPFLT)

/**
  * @brief Helper macro to retrieve pull_up precharge configuration.
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_32768
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_16384
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_8192
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_4096
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_2048
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_1024
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_512
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_256
  */
#define LL_TAMP_GET_FILTER_SAMPLE_FREQUENCY(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPFREQ)

/**
  * @brief Helper macro to retrieve the trigger edge or level.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL
  *         @arg @ref LL_TAMP_ACTIVELEVEL_TAMP
  */
#define LL_TAMP_GET_TRIGGER(tamp_config_indiv_value) ((((tamp_config_indiv_value) & \
                                                        LL_TAMP_ACTIVELEVEL_TAMP_ALL) != 0U ) ?\
                                                      LL_TAMP_ACTIVELEVEL_TAMP : LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL)

/**
  * @brief Helper macro to retrieve the mode of the tamper.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ERASE_ACTIVATE_ALL
  *         @arg @ref LL_TAMP_NOERASE_TAMPER
  */
#define LL_TAMP_GET_NOERASE(tamp_config_indiv_value) ((((tamp_config_indiv_value) &\
                                                        LL_TAMP_NOERASE_TAMPER_ALL) != 0U ) ?\
                                                      LL_TAMP_NOERASE_TAMPER : LL_TAMP_ERASE_ACTIVATE_ALL)

/**
  * @brief Helper macro to retrieve the mask of the tamper.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_MASK_NONE
  *         @arg @ref LL_TAMP_MASK_TAMPER
  */
#define LL_TAMP_GET_MASK(tamp_config_indiv_value) ((((tamp_config_indiv_value) &\
                                                     LL_TAMP_MASK_TAMPER_ALL) != 0U ) ?\
                                                   LL_TAMP_MASK_TAMPER : LL_TAMP_MASK_NONE)

/**
  * @brief Helper macro to retrieve the mode of the internal tamper.
  * @param itamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigInternalTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ITAMP_ERASE_ACTIVE_ALL
  *         @arg @ref LL_TAMP_ITAMP_NOERASE_TAMPER
  */
#define LL_TAMP_INTERNAL_GET_NOERASE(itamp_config_indiv_value) ((((itamp_config_indiv_value) &\
                                                                  LL_TAMP_ITAMP_NOERASE_TAMPER_ALL) != 0U ) \
                                                                ? LL_TAMP_ITAMP_NOERASE_TAMPER : \
                                                                LL_TAMP_ITAMP_ERASE_ACTIVE_ALL)


/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup TAMP_LL_Exported_Functions LL TAMP Functions
  * @{
  */

/** @defgroup TAMP_LL_EF_Tamper Tamper
  * @{
  */

/**
  * @brief  Enable TAMPx input detection.
  * @rmtoll
  *  TAMP_CR1       TAMPxE        LL_TAMP_Enable
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_Enable(uint32_t Tampers)
{
  STM32_SET_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Clear TAMPx input detection.
  * @rmtoll
  *  TAMP_CR1       TAMPxE         LL_TAMP_Disable
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_Disable(uint32_t Tampers)
{
  STM32_CLEAR_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Get the enabled TAMPx.
  * @rmtoll
  *  TAMP_CR1       TAMPxE         LL_TAMP_GetEnabled
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  * @retval State of the tampers enable.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetEnabled(uint32_t Tampers)
{
  return STM32_READ_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Enable TAMPx interrupts.
  * @rmtoll
  *  TAMP_IER       TAMPxIE       LL_TAMP_EnableIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_EnableIT(uint32_t TampersIT)
{
  STM32_SET_BIT(TAMP->IER, TampersIT);
}

/**
  * @brief  Disable TAMPx interrupts.
  * @rmtoll
  *  TAMP_IER       TAMPxIE       LL_TAMP_DisableIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_DisableIT(uint32_t TampersIT)
{
  STM32_CLEAR_BIT(TAMP->IER, TampersIT);
}

/**
  * @brief  Get the enabled TAMPx interrupts.
  * @rmtoll
  *  TAMP_IER       TAMPxIE        LL_TAMP_IsEnabledIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  * @retval State of the tamper interrupt enable (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledIT(uint32_t TampersIT)
{
  return ((STM32_READ_BIT(TAMP->IER, TampersIT) == (TampersIT)) ? 1UL : 0UL);

