MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tamp.h
}

/**
  * @brief  Enable Tamper mask flag.
  * @rmtoll
  *  TAMP_CR2       TAMPxMSK       LL_TAMP_EnableMask
  * @param  Mask
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_MASK
  * @note Associated Tamper IT must not be enabled when the tamper mask is set.
  */
__STATIC_INLINE void LL_TAMP_EnableMask(uint32_t Mask)
{
  STM32_SET_BIT(TAMP->CR2, Mask);
}

/**
  * @brief  Disable Tamper mask flag.
  * @rmtoll
  *  TAMP_CR2       TAMPxMSK       LL_TAMP_DisableMask
  * @param  Mask
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_MASK
  */
__STATIC_INLINE void LL_TAMP_DisableMask(uint32_t Mask)
{
  STM32_CLEAR_BIT(TAMP->CR2, Mask);
}

/**
  * @brief  Get the enabled TAMPx mask flags.
  * @rmtoll
  *  TAMP_CR2       TAMPxMSK       LL_TAMP_GetMasked
  * @param  Mask
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_MASK
  * @retval State of the tampers mask flag enable.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetMasked(uint32_t Mask)
{
  return STM32_READ_BIT(TAMP->CR2, (Mask & LL_TAMP_MASK_TAMPER_ALL));
}

/**
  * @brief  Enable TAMPx potential mode.
  * @rmtoll
  *  TAMP_CR2       TAMPxPOM     LL_TAMP_EnablePotentialMode
  * @param  Tamper
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_NOERASE
  * @note   In potential mode, the backup registers and device secrets can be blocked instead of erased.
  *         See TAMP interconnection table for more information.
  */
__STATIC_INLINE void LL_TAMP_EnablePotentialMode(uint32_t Tamper)
{
  STM32_SET_BIT(TAMP->CR2, Tamper);
}

/**
  * @brief  Disable TAMPx potential mode.
  * @rmtoll
  *  TAMP_CR2       TAMPxPOM     LL_TAMP_DisablePotentialMode
  * @param  Tamper
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_NOERASE
  */
__STATIC_INLINE void LL_TAMP_DisablePotentialMode(uint32_t Tamper)
{
  STM32_CLEAR_BIT(TAMP->CR2, Tamper);
}

/**
  * @brief  Check if the TAMPx potential mode is enabled or disabled.
  * @rmtoll
  *  TAMP_CR2       TAMPxPOM     LL_TAMP_IsEnabledPotentialMode
  * @param  Tamper
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_NOERASE
  * @retval State of TAMPx potential mode (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledPotentialMode(uint32_t Tamper)
{
  return ((STM32_READ_BIT(TAMP->CR2, Tamper) == (Tamper)) ? 1UL : 0UL);
}

/**
  * @brief Configure global tamper parameters.
  * @rmtoll
  *  TAMP_FLTCR     TAMPPUDIS    LL_TAMP_SetConfig \n
  *  TAMP_FLTCR     TAMPPRCH     LL_TAMP_SetConfig \n
  *  TAMP_FLTCR     TAMPFREQ     LL_TAMP_SetConfig \n
  *  TAMP_FLTCR     TAMPFLT      LL_TAMP_SetConfig
  * @param Pullup pull-up (precharge of TAMP pins) can be one of the following values:
  *        @arg @ref LL_TAMP_PULL_UP_ENABLE
  *        @arg @ref LL_TAMP_PULL_UP_DISABLE
  * @param Precharge time duration of the precharge can be one of the following values:
  *        @arg @ref LL_TAMP_DURATION_1RTCCLK
  *        @arg @ref LL_TAMP_DURATION_2RTCCLK
  *        @arg @ref LL_TAMP_DURATION_4RTCCLK
  *        @arg @ref LL_TAMP_DURATION_8RTCCLK
  * @param FilterCounter filter counter, can be one of the following values:
  *        @arg @ref LL_TAMP_FILTER_DISABLE
  *        @arg @ref LL_TAMP_FILTER_2SAMPLES
  *        @arg @ref LL_TAMP_FILTER_4SAMPLES
  *        @arg @ref LL_TAMP_FILTER_8SAMPLES
  * @param SampleFrequency sample frequency, can be one of the following values:
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_32768
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_16384
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_8192
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_4096
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_2048
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_1024
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_512
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_256
  */
__STATIC_INLINE void LL_TAMP_SetConfig(uint32_t Pullup, uint32_t Precharge, uint32_t FilterCounter,
                                       uint32_t SampleFrequency)
{
  STM32_WRITE_REG(TAMP->FLTCR,  Pullup | Precharge | FilterCounter | SampleFrequency);
}

/**
  * @brief Retrieve the global tamper parameters configuration.
  * @rmtoll
  *  TAMP_FLTCR     TAMPPUDIS    LL_TAMP_GetConfig \n
  *  TAMP_FLTCR     TAMPPRCH     LL_TAMP_GetConfig \n
  *  TAMP_FLTCR     TAMPFREQ     LL_TAMP_GetConfig \n
  *  TAMP_FLTCR     TAMPFLT      LL_TAMP_GetConfig
  * @retval Combined values of the pull-up precharge, precharge duration, sample frequency and filter
  */
__STATIC_INLINE uint32_t LL_TAMP_GetConfig(void)
{
  return STM32_READ_REG(TAMP->FLTCR);
}

/**
  * @brief Configure one or multiple tampers.
  * @rmtoll
  *  TAMP_CR2     TAMPxTRG    LL_TAMP_SetConfigTampers \n
  *  TAMP_CR2     TAMPxMSK    LL_TAMP_SetConfigTampers \n
  *  TAMP_CR2     TAMPxPOM    LL_TAMP_SetConfigTampers
  * @param Tampers
  *        tampers can be one of the group values @ref TAMP_LL_EC_TAMPER
  * @param Trigger trigger mode, can be one of the following values:
  *        @arg @ref LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL
  *        @arg @ref LL_TAMP_ACTIVELEVEL_TAMP
  * @param EraseSecrets tamper mode, can be one of the following values:
  *        @arg @ref LL_TAMP_ERASE_ACTIVATE_ALL
  *        @arg @ref LL_TAMP_NOERASE_TAMPER
  * @param Masked tamper masked, can be one of the following values:
  *        @arg @ref LL_TAMP_MASK_NONE
  *        @arg @ref LL_TAMP_MASK_TAMPER
  */
__STATIC_INLINE void LL_TAMP_SetConfigTampers(uint32_t Tampers, uint32_t Trigger, uint32_t EraseSecrets,
                                              uint32_t Masked)
{
  uint32_t temp1 = ((Tampers << TAMP_CR2_TAMP1TRG_Pos) | (Tampers << TAMP_CR2_TAMP1POM_Pos)
                    | ((Tampers << TAMP_CR2_TAMP1MSK_Pos) & LL_TAMP_MASK_TAMPER_ALL)) & (TAMP_CR2_CFG_MSK);
  uint32_t temp2 = (Tampers * (Trigger | Masked | EraseSecrets)) & (TAMP_CR2_CFG_MSK);
  STM32_MODIFY_REG(TAMP->CR2, temp1, temp2);
}

/**
  * @brief Retrieve one configuration tamper.
  * @rmtoll
  *  TAMP_CR2     TAMPxTRG    LL_TAMP_GetConfigTampers \n
  *  TAMP_CR2     TAMPxMSK    LL_TAMP_GetConfigTampers \n
  *  TAMP_CR2     TAMPxPOM    LL_TAMP_GetConfigTampers
  * @param Tampers
  *        tampers can be one of the group values @ref TAMP_LL_EC_TAMPER
  * @retval Combined values of the tamper masked, mode and trigger mode.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetConfigTampers(uint32_t Tampers)
{
  return STM32_READ_BIT(TAMP->CR2, ((Tampers << TAMP_CR2_TAMP1TRG_Pos) | (Tampers << TAMP_CR2_TAMP1POM_Pos)
                                    | (Tampers << TAMP_CR2_TAMP1MSK_Pos)) & TAMP_CR2_CFG_MSK);
}

/**
  * @brief  Enable TAMPx pull-up (Precharge TAMPx pins before sampling).
  * @rmtoll
  *  TAMP_FLTCR       TAMPPUDIS     LL_TAMP_EnablePullUp
  */
__STATIC_INLINE void LL_TAMP_EnablePullUp(void)
{
  STM32_CLEAR_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPPUDIS);
}

/**
  * @brief  Disable TAMPx pull-up (Disable precharge of TAMPx pins).
  * @rmtoll
  *  TAMP_FLTCR       TAMPPUDIS     LL_TAMP_DisablePullUp
  */
__STATIC_INLINE void LL_TAMP_DisablePullUp(void)
{
  STM32_SET_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPPUDIS);
}

/**
  * @brief  Check if the TAMPx pull-up is enabled or disabled.
  * @rmtoll
  *  TAMP_FLTCR       TAMPPUDIS     LL_TAMP_IsEnabledPullUp
  * @retval State of TAMPx pull-up (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledPullUp(void)
{
  return ((STM32_READ_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPPUDIS) == (TAMP_FLTCR_TAMPPUDIS)) ? 0UL : 1UL);
}

/**
  * @brief  Set TAMPx precharge duration.
  * @rmtoll
  *  TAMP_FLTCR       TAMPPRCH      LL_TAMP_SetPrecharge
  * @param  Duration This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_DURATION_1RTCCLK
  *         @arg @ref LL_TAMP_DURATION_2RTCCLK
  *         @arg @ref LL_TAMP_DURATION_4RTCCLK
  *         @arg @ref LL_TAMP_DURATION_8RTCCLK
  */
__STATIC_INLINE void LL_TAMP_SetPrecharge(uint32_t Duration)
{
  STM32_MODIFY_REG(TAMP->FLTCR, TAMP_FLTCR_TAMPPRCH, Duration);
}

/**
  * @brief  Get TAMPx precharge duration.
  * @rmtoll
  *  TAMP_FLTCR       TAMPPRCH      LL_TAMP_GetPrecharge
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TAMP_DURATION_1RTCCLK
  *         @arg @ref LL_TAMP_DURATION_2RTCCLK
  *         @arg @ref LL_TAMP_DURATION_4RTCCLK
  *         @arg @ref LL_TAMP_DURATION_8RTCCLK
  */
__STATIC_INLINE uint32_t LL_TAMP_GetPrecharge(void)
{
  return (uint32_t)(STM32_READ_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPPRCH));
}

/**
  * @brief  Set TAMPx filter count.
  * @rmtoll
  *  TAMP_FLTCR       TAMPFLT       LL_TAMP_SetFilterCount
  * @param  FilterCount This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_FILTER_DISABLE
  *         @arg @ref LL_TAMP_FILTER_2SAMPLES
  *         @arg @ref LL_TAMP_FILTER_4SAMPLES
  *         @arg @ref LL_TAMP_FILTER_8SAMPLES
  */
__STATIC_INLINE void LL_TAMP_SetFilterCount(uint32_t FilterCount)
{
  STM32_MODIFY_REG(TAMP->FLTCR, TAMP_FLTCR_TAMPFLT, FilterCount);
}

/**
  * @brief  Get TAMPx filter count.
  * @rmtoll
  *  TAMP_FLTCR       TAMPFLT       LL_TAMP_GetFilterCount
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TAMP_FILTER_DISABLE
  *         @arg @ref LL_TAMP_FILTER_2SAMPLES
  *         @arg @ref LL_TAMP_FILTER_4SAMPLES
  *         @arg @ref LL_TAMP_FILTER_8SAMPLES
  */
__STATIC_INLINE uint32_t LL_TAMP_GetFilterCount(void)
{
  return (uint32_t)(STM32_READ_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPFLT));
}

/**
  * @brief  Set Tamper sampling frequency.
  * @rmtoll
  *  TAMP_FLTCR       TAMPFREQ      LL_TAMP_SetSamplingFreq
  * @param  SamplingFreq This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_32768
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_16384
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_8192
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_4096
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_2048
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_1024
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_512
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_256
  */
__STATIC_INLINE void LL_TAMP_SetSamplingFreq(uint32_t SamplingFreq)
{
  STM32_MODIFY_REG(TAMP->FLTCR, TAMP_FLTCR_TAMPFREQ, SamplingFreq);
}

/**
  * @brief  Get Tamper sampling frequency.
  * @rmtoll
  *  TAMP_FLTCR       TAMPFREQ      LL_TAMP_GetSamplingFreq
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_32768
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_16384
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_8192
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_4096
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_2048
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_1024
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_512
  *         @arg @ref LL_TAMP_SAMPLFREQDIV_256
  */
__STATIC_INLINE uint32_t LL_TAMP_GetSamplingFreq(void)
{
  return (uint32_t)(STM32_READ_BIT(TAMP->FLTCR, TAMP_FLTCR_TAMPFREQ));
}

/**
  * @brief  Enable Active level for Tamper input.
  * @rmtoll
  *  TAMP_CR2       TAMPxTRG       LL_TAMP_EnableActiveLevel
  * @param  Tamper
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_ACTIVELEVEL
  */
__STATIC_INLINE void LL_TAMP_EnableActiveLevel(uint32_t Tamper)
{
  STM32_SET_BIT(TAMP->CR2, Tamper);
}

/**
  * @brief  Disable Active level for Tamper input.
  * @rmtoll
  *  TAMP_CR2       TAMPxTRG      LL_TAMP_DisableActiveLevel
  * @param  Tamper
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_ACTIVELEVEL
  */
__STATIC_INLINE void LL_TAMP_DisableActiveLevel(uint32_t Tamper)
{
  STM32_CLEAR_BIT(TAMP->CR2, Tamper);
}

/**
  * @brief  Check if the TAMPx active level is enabled or disabled.
  * @rmtoll
  *  TAMP_CR2       TAMPxTRG     LL_TAMP_IsEnabledActiveLevel
  * @param  Tamper
  *         This parameter can be one of the group values @ref TAMP_LL_EC_TAMPER_ACTIVELEVEL
  * @retval State of TAMPx Active level (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledActiveLevel(uint32_t Tamper)
{
  return ((STM32_READ_BIT(TAMP->CR2, Tamper) == (Tamper)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Internal_Tamper Internal Tamper
  * @{
  */

/**
  * @brief Configure one or multiple internal tampers.
  * @rmtoll
  *  TAMP_CR3     ITAMPxPOM        LL_TAMP_SetConfigInternalTampers
  * @param InternalTampers
  *        This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL
  * @param EraseSecrets tamper mode, can be one of the following values:
  *        @arg @ref LL_TAMP_ITAMP_ERASE_ACTIVE_ALL
  *        @arg @ref LL_TAMP_ITAMP_NOERASE_TAMPER
  */
__STATIC_INLINE void LL_TAMP_SetConfigInternalTampers(uint32_t InternalTampers, uint32_t EraseSecrets)
{
  uint32_t temp = InternalTampers >> LL_POSITION_FIRST_ITAMP;
  STM32_MODIFY_REG(TAMP->CR3, temp, temp * EraseSecrets);
}

/**
  * @brief Retrieve configuration for one internal tamper.
  * @rmtoll
  *  TAMP_CR3     ITAMPxPOM        LL_TAMP_GetConfigInternalTampers
  * @param InternalTampers
  *        This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL
  * @retval Value of the selected internal tamper no-erase mode.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetConfigInternalTampers(uint32_t InternalTampers)
{
  uint32_t temp = InternalTampers >> LL_POSITION_OFFSET_REG_ITAMP;
  return STM32_READ_BIT(TAMP->CR3, temp);
}

/**
  * @brief  Enable ITAMPx input detection.
  * @rmtoll
  *  TAMP_CR1       ITAMPxE        LL_TAMP_ITAMP_Enable
  * @param  InternalTampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL
  */
__STATIC_INLINE void LL_TAMP_ITAMP_Enable(uint32_t InternalTampers)
{
  STM32_SET_BIT(TAMP->CR1, InternalTampers);
}

/**
  * @brief  Disable ITAMPx input detection.
  * @rmtoll
  *  TAMP_CR1       ITAMPxE         LL_TAMP_ITAMP_Disable
  * @param  InternalTampers
  *          This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL
  */
__STATIC_INLINE void LL_TAMP_ITAMP_Disable(uint32_t InternalTampers)
{
  STM32_CLEAR_BIT(TAMP->CR1, InternalTampers);
}

/**
  * @brief  Get the enabled ITAMPx.
  * @rmtoll
  *  TAMP_CR1       ITAMPxE         LL_TAMP_ITAMP_GetEnabled
  * @param  InternalTampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_ITAMP_GetEnabled(uint32_t InternalTampers)
{
  return STM32_READ_BIT(TAMP->CR1, InternalTampers);
}

/**
  * @brief  Enable ITAMPx input detection interrupts.
  * @rmtoll
  *  TAMP_IER       ITAMPxE        LL_TAMP_ITAMP_EnableIT
  * @param  InternalTampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_ITAMP_EnableIT(uint32_t InternalTampersIT)
{
  STM32_SET_BIT(TAMP->IER, InternalTampersIT);
}

/**
  * @brief  Clear ITAMPx input detection interrupts.
  * @rmtoll
  *  TAMP_IER       ITAMPxE         LL_TAMP_ITAMP_DisableIT
  * @param  InternalTampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_ITAMP_DisableIT(uint32_t InternalTampersIT)
{
  STM32_CLEAR_BIT(TAMP->IER, InternalTampersIT);
}

/**
  * @brief  Get the enabled ITAMPx interrupts.
  * @rmtoll
  *  TAMP_IER       ITAMPxE         LL_TAMP_ITAMP_IsEnabledIT
  * @param  InternalTampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_INTERNAL_TAMPER_IT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_ITAMP_IsEnabledIT(uint32_t InternalTampersIT)
{
  return ((STM32_READ_BIT(TAMP->IER, InternalTampersIT) == (InternalTampersIT)) ? 1UL : 0UL);
}

/**
  * @}
  */

