MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_tamp.h
/** @defgroup TAMP_LL_EF_Backup_Registers Backup_Registers
  * @{
  */

/**
  * @brief  Writes a data in a specified Backup data register.
  * @rmtoll
  *  TAMP_BKPxR        BKP           LL_TAMP_BKP_SetRegister
  * @param  BackupRegister This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @param  Data Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE void LL_TAMP_BKP_SetRegister(uint32_t BackupRegister, uint32_t Data)
{
  uint32_t tmp;

  tmp = (uint32_t)(&(TAMP->BKP0R));
  tmp += (BackupRegister * 4U);

  /* Write the specified register */
  *(__IO uint32_t *)tmp = (uint32_t)Data;
}

/**
  * @brief  Reads data from the specified TAMP Backup data Register.
  * @rmtoll
  *  TAMP_BKPxR        BKP           LL_TAMP_BKP_GetRegister
  * @param  BackupRegister This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_TAMP_BKP_GetRegister(uint32_t BackupRegister)
{
  uint32_t tmp;

  tmp = (uint32_t)(&(TAMP->BKP0R));
  tmp += (BackupRegister * 4U);

  /* Read the specified register */
  return (*(__IO uint32_t *)tmp);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get tampers interrupt flags.
  * @rmtoll
  *  TAMP_SR          TAMPx       LL_TAMP_IsActiveFlag_TAMP
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_TAMP(uint32_t Tampers)
{
  return ((STM32_READ_BIT(TAMP->SR, Tampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get internal tampers interrupt flags.
  * @rmtoll
  *  TAMP_SR          ITAMPx       LL_TAMP_IsActiveFlag_ITAMP
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_ITAMP(uint32_t InternalTampers)
{
  return ((STM32_READ_BIT(TAMP->SR, InternalTampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_MISR          TAMPxMF       LL_TAMP_IsActiveFlag_TAMPM
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_TAMPM(uint32_t Tampers)
{
  return ((STM32_READ_BIT(TAMP->MISR, Tampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get internal tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_MISR          ITAMPxMF       LL_TAMP_IsActiveFlag_ITAMPM
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_ITAMPM(uint32_t InternalTampers)
{
  return ((STM32_READ_BIT(TAMP->MISR, InternalTampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Clear tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_SCR          CTAMPxF       LL_TAMP_ClearFlag_TAMP
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_ClearFlag_TAMP(uint32_t Tampers)
{
  STM32_WRITE_REG(TAMP->SCR, Tampers);
}

/**
  * @brief  Clear internal tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_SCR          CITAMPxF       LL_TAMP_ClearFlag_ITAMP
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  */
__STATIC_INLINE void LL_TAMP_ClearFlag_ITAMP(uint32_t InternalTampers)
{
  STM32_WRITE_REG(TAMP->SCR, InternalTampers);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Device_Secret_Management Device_Secret Management
  * @{
  */

/**
  * @brief Block access to the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_BlockDeviceSecretsAccess
  */
__STATIC_INLINE void LL_TAMP_BlockDeviceSecretsAccess(void)
{
  STM32_SET_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK);
}

/**
  * @brief Unblock access to the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_UnblockDeviceSecretsAccess
  */
__STATIC_INLINE void LL_TAMP_UnblockDeviceSecretsAccess(void)
{
  STM32_CLEAR_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK);
}

/**
  * @brief Check if the access to the backup registers and device secrets is blocked.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_IsBlockedDeviceSecretsAccess
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsBlockedDeviceSecretsAccess(void)
{
  return ((STM32_READ_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK) == (TAMP_CR2_BKBLOCK)) ? 1UL : 0UL);
}

/**
  * @brief Erase the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKERASE    LL_TAMP_EraseDeviceSecrets
  */
__STATIC_INLINE void LL_TAMP_EraseDeviceSecrets(void)
{
  STM32_SET_BIT(TAMP->CR2, TAMP_CR2_BKERASE);
}


/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Remap Tamp remap
  * @{
  */
/**
  * @brief  Enable remap of TAMP INx on a different pin.
  * @rmtoll
  *  TAMP_OR           IN2_RMP       LL_TAMP_EnableRemap \n
  *  TAMP_OR           IN3_RMP       LL_TAMP_EnableRemap
  * @param  tamp_remap This parameter can be a combination of the following values:
  *         @arg @ref LL_TAMP_RMP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref LL_TAMP_RMP_TAMP_IN3_PA1_TO_PA2
  */
__STATIC_INLINE void LL_TAMP_EnableRemap(uint32_t tamp_remap)
{
  STM32_SET_BIT(TAMP->OR, tamp_remap);
}

/**
  * @brief  Disable remap of TAMP INx on a different pin.
  * @rmtoll
  *  TAMP_OR           IN2_RMP       LL_TAMP_DisableRemap \n
  *  TAMP_OR           IN3_RMP       LL_TAMP_DisableRemap
  * @param  tamp_remap This parameter can be a combination of the following values:
  *         @arg @ref LL_TAMP_RMP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref LL_TAMP_RMP_TAMP_IN3_PA1_TO_PA2
  */
__STATIC_INLINE void LL_TAMP_DisableRemap(uint32_t tamp_remap)
{
  STM32_CLEAR_BIT(TAMP->OR, tamp_remap);
}

/**
  * @brief  Check if remap of TAMP INx is enabled or disabled.
  * @rmtoll
  *  TAMP_OR           IN2_RMP       LL_TAMP_IsEnabledRemap \n
  *  TAMP_OR           IN3_RMP       LL_TAMP_IsEnabledRemap
  * @param  tamp_remap This parameter can be a combination of the following values:
  *         @arg @ref LL_TAMP_RMP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref LL_TAMP_RMP_TAMP_IN3_PA1_TO_PA2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledRemap(uint32_t tamp_remap)
{
  return ((STM32_READ_BIT(TAMP->OR, tamp_remap) == tamp_remap) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Privilege_Services Privilege Services
  * @{
  */

/**
  * @brief  Set privilege attribute configuration.
  * @rmtoll
  *  PRIVCFGR           TAMPPRIV            LL_TAMP_SetPrivAttr \n
  *  PRIVCFGR           BKPWPRIV            LL_TAMP_SetPrivAttr \n
  *  PRIVCFGR           BKPRWPRIV           LL_TAMP_SetPrivAttr
  * @param item This parameter can be one or a combination of the following values:
  *        @arg @ref LL_TAMP_PRIV_ITEM_TAMPPRIV
  *        @arg @ref LL_TAMP_PRIV_ZONE_BKPWPRIV
  *        @arg @ref LL_TAMP_PRIV_ZONE_BKPRWPRIV
  * @param priv_attr This parameter can be one of the following values:
  *        @arg @ref LL_TAMP_ATTR_PRIV
  *        @arg @ref LL_TAMP_ATTR_NPRIV
  */
__STATIC_INLINE void LL_TAMP_SetPrivAttr(uint32_t item, uint32_t priv_attr)
{
  STM32_MODIFY_REG(TAMP->PRIVCFGR, item, (item & ((~priv_attr) + 1U)));
}

/**
  * @brief  Get privilege attribute configuration.
  * @rmtoll
  *  PRIVCFGR           TAMPPRIV            LL_TAMP_GetPrivAttr \n
  *  PRIVCFGR           BKPWPRIV            LL_TAMP_GetPrivAttr \n
  *  PRIVCFGR           BKPRWPRIV           LL_TAMP_GetPrivAttr
  * @param  item This parameter can be one of the following values:
  *        @arg @ref LL_TAMP_PRIV_ITEM_TAMPPRIV
  *        @arg @ref LL_TAMP_PRIV_ZONE_BKPWPRIV
  *        @arg @ref LL_TAMP_PRIV_ZONE_BKPRWPRIV
  * @retval Status of bit (1 or 0).
  *         - 1: Privileged attribute enabled for the item.
  *         - 0: Non-privileged attribute for the item.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetPrivAttr(uint32_t item)
{
  return ((STM32_READ_BIT(TAMP->PRIVCFGR, item) == (item)) ? LL_TAMP_ATTR_PRIV : LL_TAMP_ATTR_NPRIV);
}

/**
  * @brief  Set backup register protection boundary start index of Zone 2 and Zone 3.
  * @rmtoll
  *  CFGR              BKPRW              LL_TAMP_SetBackupRegProtection \n
  *  CFGR              BKPW               LL_TAMP_SetBackupRegProtection
  * @param  start_zone2 This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @param  start_zone3 This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  */
__STATIC_INLINE void LL_TAMP_SetBackupRegProtection(uint32_t start_zone2, uint32_t start_zone3)
{
  STM32_MODIFY_REG(TAMP->CFGR, (TAMP_CFGR_BKPRW_Msk | TAMP_CFGR_BKPW_Msk),
                   (start_zone2 << TAMP_CFGR_BKPRW_Pos) |
                   (start_zone3 << TAMP_CFGR_BKPW_Pos));
}

/**
  * @brief  Get backup register protection boundary start index of Zone 2.
  * @note   Zone 1 : read protection write protection
  * @note   Zone 2 : read non-protection  write protection
  * @note   Zone 3 : read non-protection  write non-protection
  * @rmtoll
  *  TAMP_CFGR             BKPRW            LL_TAMP_GetBackupRegStartZone2
  * @retval Start index of backup zone 2
  */
__STATIC_INLINE uint32_t LL_TAMP_GetBackupRegStartZone2(void)
{
  return STM32_READ_BIT(TAMP->CFGR, TAMP_CFGR_BKPRW_Msk) >> TAMP_CFGR_BKPRW_Pos;
}

/**
  * @brief  Get backup register protection boundary start index of Zone 3.
  * @note   Zone 1 : read protection write protection
  * @note   Zone 2 : read non-protection  write protection
  * @note   Zone 3 : read non-protection  write non-protection
  * @rmtoll
  *  TAMP_CFGR             BKPW              LL_TAMP_GetBackupRegStartZone3
  * @retval Start index of backup zone 3
  */
__STATIC_INLINE uint32_t LL_TAMP_GetBackupRegStartZone3(void)
{
  return STM32_READ_BIT(TAMP->CFGR, TAMP_CFGR_BKPW_Msk) >> TAMP_CFGR_BKPW_Pos;
}


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(TAMP) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_TAMP_H */
